scripts/bzt/bzt-jmeter-demo-1.yml
# To demonstrate how to run multiple jmeter tests as different scenario in parallel
# bzt scripts\bzt\bzt-jmeter-demo-1.yml
---
execution:


# Test Scenarios
# https://gettaurus.org/docs/JMeter/#Run-Existing-JMX-File
# https://marketplace.visualstudio.com/items?itemName=AlexandreGattiker.jmeter-tasks
- executor: jmeter
  scenario: SCENARIO-1
  concurrency: 1
  ramp-up: 1s
  iterations: 1
  # hold-for: 1m

- executor: jmeter
  scenario: SCENARIO-2
  concurrency: 1
  ramp-up: 1s
  iterations: 1
  # hold-for: 1m


scenarios:
  SCENARIO-1:
    script: jmeter/src/test/jmeter/performance/jmeter-test-1.jmx

  SCENARIO-2:
    script: jmeter/src/test/jmeter/performance/jmeter-test-2.jmx