scripts/bzt/bzt-jmeter-demo-3.yml
# To demonstrate parameterization and pass in parameter values via command line.
# bzt scripts\bzt\bzt-jmeter-demo-3.yml \
# -o settings.env.APP_HOST=test-api.k6.io \
# -o execution.0.concurrency=1 \
# -o execution.0.ramp-up=1s \
# -o execution.0.iterations=10 \
# -o execution.1.concurrency=1 \
# -o execution.1.ramp-up=1s \
# -o execution.1.iterations=10
---
settings:
  env:
    APP_HOST: test-api.k6.io
    JMX_1: jmeter-test-1
    JMX_2: jmeter-test-2

execution:

# Test Scenarios
# https://gettaurus.org/docs/JMeter/#Run-Existing-JMX-File
# https://marketplace.visualstudio.com/items?itemName=AlexandreGattiker.jmeter-tasks
- executor: jmeter
  scenario: SCENARIO-1
  concurrency: 1
  ramp-up: 1s
  iterations: 1
  # hold-for: 1m

- executor: jmeter
  scenario: SCENARIO-2
  concurrency: 1
  ramp-up: 1s
  iterations: 1
  # hold-for: 1m


scenarios:
  SCENARIO-1:
    variables:
      HOST: ${APP_HOST}
    script: jmeter/src/test/jmeter/performance/${JMX_1}.jmx

  SCENARIO-2:
    variables:
      HOST: ${APP_HOST}
    script: jmeter/src/test/jmeter/performance/${JMX_2}.jmx

# To generate *.csv output file to publish performance results in Jenkins
reporting:
- module: final-stats
  summary: true  # overall samples count and percent of failures
  percentiles: true  # display average times and percentiles
  summary-labels: false # provides list of sample labels, status, percentage of completed, avg time and errors
  failed-labels: false  # provides list of sample labels with failures
  test-duration: true  # provides test duration
  dump-xml: results/results.xml
  dump-csv: results/results.csv

# IF running in Windows Platform, please use Batch command instead
services:
- module: shellexec
  prepare:
  - if not exist results mkdir results